MENU = "🥗 меню"
CONTACTS = "🛍 контакти"
SHOW_CART = "🔦 показати кошик"
CREATE_ORDER = "🛒 оформити замовлення"
CLEAR_CART = "🧨 очистити кошик"
BACK = "⏪ назад до меню"
ADD_TO_CART = "📥 додати до кошика"
YES = "✅ так"
NO = "❌ ні"
NEW = "new"
EDIT = "edit"
DELETE = "delete"
SHOW_ALL = "show all"
ESPRESSO = "ESPRESSO"
FILTER = "FILTER"
BOTH = "BOTH"
SHARE_PHONE_BTTN = "📲 поділитись номером телефону"

SET_DELIVERY_SPOT = "📩 обери спосіб доставки:"
DELIVERY_OLC = "📍 заберу сам"
DELIVERY_TAXI = "🚕 доставка за адресою"
TYPE_DELIVERY_ADDRESS = "🛤 вкажи адресу доставки: "
TYPE_ARRIVING_TIME = "⏰ через скільки хвилин тебе чекати?"


DRINKS = "🥤 напої"
COFFEE = "🥡 пакунки кави"
DESSERTS = "🍰 десерти"
FOOD = "🥙 кухня"

CHOOSE_GRIND_TYPE = "🥡 в чому ти зазвичай заварюєш каву?"
GRIND_TYPES = [
    "воронка на 1 чашку",
    "воронка на 2 чашки",
    "аеропрес",
    "чашка",
    "гейзер",
    "турка"
]


WELCOME_MESSAGE = "👋🏼 привіт!\n\n👾 я - ONE LOVE bot\n\n☕️ доставимо безкоштовно в радіусі 2 км при замовленні на" \
                  " суму від 150 грн\n\n⏰ замовлення на доставку приймаю з 10 до 21."
CONTACTS_MESSAGE = "🌉 кав'ярні знаходяться за адресами:\n\n" \
                   "📍 вул. велика васильківська, 100\n📞 +380443649896\n" \
                   "🕰 пн-пт: 9-20    сб-нд: 10-20\n\n" \
                   "📍 вул. хрещатик, 38, ЦУМ, -1 та 6 поверх\n📞 +380442904290\n" \
                   "🕰 пн-нд: 10-22"
MENU_DESCRIBE_MESSAGE = "⤵️ тут можна переглянути меню️"
CLEAR_CART_MESSAGE = "🥚 кошик порожній"
COFFEE_PACK_IS_IN_MENU = "🤔 потрібно змолоти пакунок?"

CART_CANNOT_BE_EMPTY = "🤡 кошик не може бути порожнім"
CAFE_IS_CLOSED = "⏰ кав'ярня зараз зачинена, тому замовлення оформити поки ще не можна"

SHARE_YOUR_NUMBER = "👾 поділись зі мною своїм номером, щоб з тобою можна було зв'язатись"
WAITING_FOR_PAY = "⭕️ очікуємо оплату"
SUCCESSFUL_PAYMENT = "✅ оплата успішна"
FAILED_PAYMENT = "❌ оплата відсутня"

